In [3]:
A=[1,2,3,4,5,6]
B=[4,6,78,8,56,12,11]
print(zip(A,B))

<zip object at 0x000001DDFE499B48>

In [4]:
print(list(zip(A,B)))

[(1, 4), (2, 6), (3, 78), (4, 8), (5, 56), (6, 12)]

In [6]:
one=[56,24,63,90]
two=[12,85,89,12]
print(zip(one,two))

<zip object at 0x000001DDFE527288>

In [10]:
print(list(zip(one,two)))

[(56, 12), (24, 85), (63, 89), (90, 12)]

In [12]:
a=[24,56,63,90]
b=[85,12,89,12]
one=(list(zip(a,b)))
one.sort(key = lambda x: x[1])
print("acc second element")
print(one)
print("acc first element")
one.sort()
print(one)

acc second element
[(56, 12), (90, 12), (24, 85), (63, 89)]
acc first element
[(24, 85), (56, 12), (63, 89), (90, 12)]

In [13]:
#FILTER

In [14]:
filter(lambda x:x%2==0,[10,11,12,13,14,15,16,17,18,19])

In [15]:
list(filter(lambda x:x%2==0,[10,11,12,13,14,15,16,17,18,19]))

[10, 12, 14, 16, 18]

In [16]:
map(lambda x:x*x , [10,5,1,2,6,7,8,4,3])

In [17]:
list(map(lambda x:x*x , [10,5,1,2,6,7,8,4,3]))

[100, 25, 1, 4, 36, 49, 64, 16, 9]

In [18]:
f=open('file1.txt','x')

In [19]:
f=open('file1.txt','r')

In [21]:
print(f.read())

In [22]:
#showing nothing as the file is empty

In [23]:
f=open('file1.txt','w')

In [25]:
f.write("python is a wonderful language")
#it will show the string length

30

In [60]:
f=open('file1.txt','r')
print(f.read())
#Now it will print the entered statement

python is a wonderful languagepython is a wonderful language

In [61]:
print(f.read(30))

In [62]:
print(f.readline())

In [55]:
f.close()

In [63]:
f=open('file3.txt','w')
f.write("AI is a life saver!!")
f.close()

In [64]:
import os
os.remove('file1.txt')

In [65]:
os.remove('file3.txt')

EXCEPTION HANDLING

In [67]:
try:
    a=10/0
except:
    print("This is impossible")

This is impossible

In [68]:
try:
    print(x)
except:
    print("Something went wrong")
finally:
    print("The 'Try Except' is finished")

Something went wrong
The 'Try Except' is finished

In [70]:
try:
    a=9.5
    a.lower()
except:
    print("String method cannot be converted to lower case")

String method cannot be converted to lower case

In [73]:
try:
    a=9.9/0
except:
    print("Zero Division error")
    
    #Error is due to false detection of error, then; remove"AttributeError" that is added with except

Zero Division error

In [75]:
try:
    print(yu)
except:
    print("variable yu is not defined")
else:
    print("Something else went wrong")

variable yu is not defined

In [77]:
try:
    print("HELLO WORLD")
except:
    print("Something went wrong")
else:
    print("Nothing went wrong")

HELLO WORLD
Nothing went wrong

In [86]:
f=open("rudrasish1.txt","x")

In [87]:
f.write("AI will change the world")

24

In [88]:
f.close()

In [103]:
f=open("rudrasish.txt","w")
try:
    f.write("Hello World")
except:
    print("It is not Writable")
else:
    print("It is possible to write")
f.close()

It is possible to write

In [104]:
import os
os.remove("rudrasish.txt")

In [112]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

In [113]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [110]:
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']

In [111]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [115]:
data.loc[(data.age<=18),['city','gender']]

      city gender
0  Gurgaon      M
2   Mumbai      F
4   Mumbai      M
5    Delhi      M
6   Mumbai      F

In [116]:
data.iloc[[1,2]]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow

In [117]:
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       C   Mumbai      F          yellow

Qno1- By importing required module create a dataframe.
Display the dataframe {
'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 
'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019], 
'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000, 31000, 15000, 12000], 
'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi','Mumbai','Chennai', 'Ghaziabad'], 
'Mileage' : [28, 27, 25, 26, 28, 29, 24, 21, 24]}
*After creating perform the following set of questions:- 
1.selecting cars with brand 'Maruti' and Mileage > 25 
2.selecting range of rows from 2 to 5 3.updating values of Mileage if Year < 2015 4.selecting 0th, 2th, 4th, and 7th index rows 5.selecting rows from 1 to 4 and columns from 2 to 4
 .selecting range of rows from 2 to 5 
3.updating values of Mileage if Year < 2015 
4.selecting 0th, 2th, 4th, and 7th index rows 
5.selecting rows from 1 to 4 and columns from 2 to 4

In [120]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 
    'Year' : [2012, 2014, 2011, 2015, 2012, 2016, 2014, 2018, 2019], 
    'Kms Driven' : [50000, 30000, 60000, 25000, 10000, 46000, 31000, 15000, 12000], 
    'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi', 'Mumbai','Chennai', 'Ghaziabad'], 
    'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]
})

In [121]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [126]:
data.loc[(data.Brand=='Maruti')&(data.Mileage > 25) ]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [127]:
display(data.iloc[[0,2,4,7]])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28
7    Tata  2018       15000  Chennai       21

In [132]:
data.loc[(data.Year < 2015),['Mileage']]

   Mileage
0       12
1       12
2       12
4       12
6       12

In [133]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       12
1   Hyundai  2014       30000      Delhi       12
2      Tata  2011       60000     Mumbai       12
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       12
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       12
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [138]:
display(data.iloc[[2,3,4,5]])

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       12
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       12
5   Hyundai  2016       46000   Delhi       29

In [158]:
#selecting range of rows from 2 to 5 
twofiv = data.loc[2:5]
display(twofiv)

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       12
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       12
5   Hyundai  2016       46000   Delhi       29

In [180]:
#selecting rows from 1 to 4 and columns from 2 to 4
ratio= data.iloc[1:4 , 2:5]
display(ratio)

   Kms Driven    City  Mileage
1       30000   Delhi       12
2       60000  Mumbai       12
3       25000   Delhi       26

Qno-By importing required module create a dataframe.Display the dataframe {'age':[30, 2, 12, 4, 32, 33, 69], 'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] 

**After creating perform the f
**After creating perform the following set of questions:- 
1.selecting column penelope
2.selecting columns cornelia,jane,dean 
3.selecting columns from aaron upto dean 
4.selecting 4th index column
5.selecting rows from 1 to 4 and 2nd column

In [144]:
data1=pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69], 
  'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 
  'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 
  'height':[165, 70, 120, 80, 180, 172, 150], 
  'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 
  'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] 
 }, 
 index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] 
)
display(data1)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [151]:
data1.loc['Penelope']

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [153]:
data2=data1.loc[['Cornelia','Jane','Dean']]
display(data2)

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [155]:
data3=data1.loc['Aaron':'Dean']
display(data3)

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [174]:
#selecting 4th index column
data4=data1.iloc[4]
display(data4)

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [181]:
#5.selecting rows from 1 to 4 and 2nd column
data5=data1.iloc[[1,4],2]

In [183]:
display(data5)

Nick      Lamb
Dean    Cheese
Name: food, dtype: object